.. _rc_userguide:

RC Strings
============

Introduction
------------

The function :func:`clean_cz_rc() <dataprep.clean.clean_cz_rc.clean_cz_rc>` cleans a column containing Czech birth number (RC) strings, and standardizes them in a given format. The function :func:`validate_cz_rc() <dataprep.clean.clean_cz_rc.validate_cz_rc>` validates either a single RC strings, a column of RC strings or a DataFrame of RC strings, returning `True` if the value is valid, and `False` otherwise.

RC strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "7103192745"
* `standard`: RC strings with proper whitespace in the proper places, like "710319/2745"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_cz_rc()` and `validate_cz_rc()`.

### An example dataset containing RC strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "rc": [
            "7103192745",
            "7103192746",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

               rc                                           address
0      7103192745                                     123 Pine Ave.
1      7103192746                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_cz_rc`

By default, `clean_cz_rc` will clean rc strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_cz_rc
clean_cz_rc(df, column = "rc")

,rc,address,rc_clean
0,7103192745,123 Pine Ave.,710319/2745
1,7103192746,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_cz_rc(df, column = "rc", output_format="standard")

,rc,address,rc_clean
0,7103192745,123 Pine Ave.,710319/2745
1,7103192746,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_cz_rc(df, column = "rc", output_format="compact")

,rc,address,rc_clean
0,7103192745,123 Pine Ave.,7103192745
1,7103192746,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned RC strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_cz_rc(df, column="rc", inplace=True)

      rc_clean                                           address
0  710319/2745                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN  (staples center) 1111 S Figueroa St, Los Angeles
6          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_cz_rc(df, "rc", errors="coerce")

,rc,address,rc_clean
0,7103192745,123 Pine Ave.,710319/2745
1,7103192746,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_cz_rc(df, "rc", errors="ignore")

,rc,address,rc_clean
0,7103192745,123 Pine Ave.,710319/2745
1,7103192746,main st,7103192746
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_cz_rc()`

`validate_cz_rc()` returns `True` when the input is a valid RC. Otherwise it returns `False`.

The input of `validate_cz_rc()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_cz_rc()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_cz_rc()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_cz_rc
print(validate_cz_rc("7103192745"))
print(validate_cz_rc("7103192746"))
print(validate_cz_rc("51824753556"))
print(validate_cz_rc("51 824 753 556"))
print(validate_cz_rc("hello"))
print(validate_cz_rc(np.nan))
print(validate_cz_rc("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_cz_rc(df["rc"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: rc, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_cz_rc(df, column="rc")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: rc, dtype: bool

### Only DataFrame

In [11]:
validate_cz_rc(df)

      rc  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False